In [22]:
import pandas as pd

In [23]:
data = [['1', '1', 'N'], ['2', '1', 'Y'], ['2', '2', 'N'], ['3', '3', 'N'], ['4', '2', 'N'], ['4', '3', 'Y'], ['4', '4', 'N']]
employee = pd.DataFrame(data, columns=['employee_id', 'department_id', 'primary_flag']).astype({'employee_id':'Int64', 'department_id':'Int64', 'primary_flag':'object'})

In [24]:
employee

   employee_id  department_id primary_flag
0            1              1            N
1            2              1            Y
2            2              2            N
3            3              3            N
4            4              2            N
5            4              3            Y
6            4              4            N

In [25]:
primary_departement = employee['primary_flag'] == 'Y'

In [26]:
primary_departement

0    False
1     True
2    False
3    False
4    False
5     True
6    False
Name: primary_flag, dtype: bool

In [27]:
single_department = employee['employee_id'].duplicated(keep=False)

In [28]:
single_department

0    False
1     True
2     True
3    False
4     True
5     True
6     True
Name: employee_id, dtype: bool

In [29]:
employee.loc[~single_department | primary_departement, ["employee_id", "department_id"]]

   employee_id  department_id
0            1              1
1            2              1
3            3              3
5            4              3

In [30]:
data = [['1', '1', 'N'], ['2', '1', 'Y'], ['2', '2', 'N'], ['3', '3', 'N'], ['4', '2', 'N'], ['4', '3', 'Y'], ['4', '4', 'N']]
employee = pd.DataFrame(data, columns=['employee_id', 'department_id', 'primary_flag']).astype({'employee_id':'Int64', 'department_id':'Int64', 'primary_flag':'object'})

In [32]:
x = employee.groupby('employee_id').filter(lambda x: len(x) == 1)
x

   employee_id  department_id primary_flag
0            1              1            N
3            3              3            N

In [34]:
y = employee.groupby('employee_id').filter(lambda x: len(x) > 1)
y

   employee_id  department_id primary_flag
1            2              1            Y
2            2              2            N
4            4              2            N
5            4              3            Y
6            4              4            N

In [36]:
y = y[y['primary_flag'] == 'Y']
y

   employee_id  department_id primary_flag
1            2              1            Y
5            4              3            Y

In [37]:
pd.concat([x,y])

   employee_id  department_id primary_flag
0            1              1            N
3            3              3            N
1            2              1            Y
5            4              3            Y